<div style="text-align: center;">
   <span style="color: #67AB29;font-size: 20px; font-weight: bold;"> La  preparation des données  </span>
 </div>

### 1.1 <u>  chargement des données</u>
- csv file : pd.read_csv('chemin', sep=';', encoding = 'utf-8')
- excel file : pd.read_excel('chemin.xlsx' )
- sql :
       - import sqlite3
       - connec = sqlite3.connect3('base_de_donnes.db')
       - df = pd.read_sql_query("SELECT * FROM table", conn)

### 1.2 Exploration des données
- df.head() : premieres lignes
- df.tail: dernieres lignes
- df.info() : info sur les types et valeurs manquantes
- df.describe() : stat descriptives sur les colonnes numeriques
- df.columns : liste les colonnes
- df.dtypes : liste les types des colonnes

### 1.3 Nettoyage des données

#### Gestion des valeurs manquantes 
    - df.dropna() : supprime les lignes avec NA
    - df.fillna(value = 0) : remplace les NA par O
    - df['col'].fillna(df['col'].mean(), inplace = True) : remplace les NA par la valeu des moyennes des valeurs de la colonne
    - df.replace(to_replace = np.nan, value = 0) : remplace NaN par 0
    - df.mask(df > 10 , np.nan)  : remplace les valeurs superieurs á 10 par  NaN

#### Apres suppression des valeurs manquantes ou le remplissage des valeurs manquantes, il est conseillé de verifier les doubloms dans les dataFrames :
    -df.duplicated() : identifie les lignes en double
    -drop_duplicates() : supprimes les doublons
#### Verification de la memoire avant et apres gestion des valeurs manquantes 
    - df.memory_usage(deep = True)

#### Conversion des types apres remplissage fortement conseillé
    - df[''].astype('int64')
### Suppression des doublons 
    - df.drop_duplicates(inplace = True) : supprimer les doublons afin d'éviter les biais dans les analyses 
    
    
### Transformation de types de donnés
    - df['col'] = pd.to_numeric(df['col'], erros = 'coerce') : convertir une colonne en numerique 
    - df['date_colonne'] = pd.to_datetime(df['date_colonne']) : convertir une colonne en datetime

## 1.4 Filtrage et selection des données

### Selection de colonnes 
   - df[['col1', 'col2']]

### Filtrer les lignes 
   - df[df['col'] > 20] : lignes ou valeur de col superieur á 20
   - df[(df['col1'] < 30) & (df['col2'] == 'valeur ') ] : plusieurs conditions sur les lignes

### Reindexer et reorganiser les données
    - df.reset_index(drop = True, inplace = True) : reindexer les lignes 
    - df[df['col2', 'col1', 'col3']] : reorganiser les colonnes

## 1.5 transformation des donnees

#### TRansformation de textes 
  - df['col'] = df['col'].str.lower() : passer en minuscule
  - df['new_col'] = df['col'].str[:5] : extraits les 5 premieres caracteres 


#### Binning
df['col'] = pd.cut(df['val'], bins = [0, 10 , 20 , 30], labels= ['petit', 'moyen', 'grand'])

In [20]:
#import pandas as pd
#import numpy as np

#df = pd.DataFrame({'revenues':np.array(np.arange(0, 30, ))})
#df = pd.cut(df['revenues'], bins = [-1, 10,  20, 30], labels =  ['small', 'short', 'high'])

### 2. Chargement csv

#### 2.1. Chargement de base d'un fichier CSV
    - gerer les en-tetes : pd.read_csv('chemin_.csv', header = None, names = ['col1', 'col2'] )
    - specifier colonnes á lire : pd.read_csv('chemin', usecols = ['', ''])
    - gestion types de données : pd.read_csv('chemin_.csv', dtype={'col1': 'int32', 'col2': 'float64'})
    - valeurs manquantes : pf.read_csv('chemin', na_values = ['NA', 'N/A', 'n/a'])
    - chargement partial : pd.read_csv('chemin', nrows = 1000)
    - lecteure par blocks : chunks = pd.read_csv('chemin', chunksize = 1000 )
                            print(chunks.head()) : 5 premieres lignes du bloc itere

In [39]:
#### 2.2 Temps de chargement :
import pandas as pd 
import time 
def mesurer_temps(file_csv, separateur = ";"):
    start_time = time.time() # Demare le chronometre
    df = pd.read_csv(file_csv, sep = separateur) # chargement csv
    end_time = time.time() # arret chronometre
    temps_total = end_time - start_time # calcul du temps ecoulé
    print(f"Le chargement du fichier a pris {temps_total:.4f} secondes.")
    return df

df = mesurer_temps('bod_livre124/NotebookJupyter/f04/sejour_hote.csv')
df.head()

Le chargement du fichier a pris 0.0086 secondes.

,id,nom_prenom,age,ville,note_sur_20,depense_loisir,surface_habitable,publicite_web,date_location
0,1,Alexandria Hernandez,71,Colmar,"12,99","3372,38","100,02",non,18/10/2024
1,2,Victor de la Denis,48,La Rochelle,"3,99","6313,1","39,79",non,12/08/2024
2,3,Margaux Guérin,41,Dijon,"10,33","4104,24","190,02",non,28/05/2024
3,4,Victoire Le Roux de la Roy,75,Argenteuil,"10,29","9132,04","57,9",oui,20/08/2024
4,5,Célina Philippe-Delorme,32,Nice,"19,92","3699,62","273,11",non,27/02/2024

$\textbf{timeit}$ pour plus de precision

In [126]:
import pandas as pd

df = pd.read_csv('C:/Users/Gildas/Documents/excel/sejour_hote.csv', sep=";")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   nom_prenom         1000 non-null   object
 1   age                1000 non-null   int64
 2   ville              1000 non-null   object
 3   note_sur_20        1000 non-null   float64
 4   depense_loisir     1000 non-null   float64
 5   surface_habitable  1000 non-null   float64
 6   publicite_web      1000 non-null   object
 7   date_location      1000 non-null   object
dtypes: float64(3), int64(1), object(4)
memory usage: 62.6+ KB

In [127]:
### Transformation necessaire
## date_location en object et non date 
df['date_location'] = pd.to_datetime(df['date_location'], errors = 'coerce' , dayfirst= True) ## coerc laisse les varleurs non 
                                                                                               ##convertibles en not a datetime b
print(df['date_location'].dtype)

datetime64[ns]

In [128]:
## object to float
#df['note_sur_20'] = df['note_sur_20'].str.replace(',', '.')
df['note_sur_20'] = pd.to_numeric(df['note_sur_20'], errors = 'coerce')
df['note_sur_20'].head()

0    12.99
1     3.99
2    10.33
3    10.29
4    19.92
Name: note_sur_20, dtype: float64

In [129]:
### fonction pr convertir les objects en floats 
def pr_convertir_object_vers_numeric(df:pd.DataFrame, nom_col:str):
    ##remplacer virgule pour avoir un format correct de decimal
    # df[nom_col] = df[nom_col].str.replace(',', '.')
    ## convertir en Float
    df[nom_col] = pd.to_numeric(df[nom_col], errors = 'coerce')

pr_convertir_object_vers_numeric(df, 'depense_loisir')
pr_convertir_object_vers_numeric(df, 'surface_habitable')

#### convertir en booleen avec map

In [102]:
## convertir en miniscule au cas oú on aurait des Oui oui Non ....
#df['publicite_web'] = df['publicite_web'].str.lower()
## convertir en Booleen 
df['publicite_web'] = df['publicite_web'].map({'oui': True, 'non':False})
#df['publicite_web'].head()

## Cas pratique : dotation_personnel.csv

In [142]:
dotation = pd.read_csv('bod_livre124/bod_livre124/NotebookJupyter/f04/dotation_du_personnel.csv', sep= ";", encoding= "utf-8")
dotation.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        50 non-null     int64
 1   nom       43 non-null     object
 2   prenom    43 non-null     object
 3   age       50 non-null     int64
 4   dotation  40 non-null     object
dtypes: int64(2), object(3)
memory usage: 2.1+ KB

In [138]:
## 5 derniers lignes 
dotation.tail()

    id       nom    prenom  age dotation
45  46   Bernier       NaN   67    589,5
46  47  Thibault    Louise   71      NaN
47  48   Blondel     Roger   77    215,8
48  49      Lévy    Gérard   86   109,02
49  50  Langlois  Nathalie   41      NaN

In [144]:
### nombre de valeurs manquantes par colonnes
dotation.isna().sum()

id           0
nom          7
prenom       7
age          0
dotation    10
dtype: int64

##### Transforme sur la colonne dotation qui doit etre en float et non en object

In [143]:
## remplacer les virgules par des points afin de bien preparer a la conversion numeric
dotation['dotation'] = dotation['dotation'].str.replace(',', '.')

## convertir en float 
dotation['dotation'] = pd.to_numeric(dotation['dotation'], errors = 'coerce')
dotation['dotation'].dtype

dtype('float64')

In [133]:
### verification de l'exactitude des colonnes
dotation.dtypes

id            int64
nom          object
prenom       object
age           int64
dotation    float64
dtype: object

##### Lignes ou les noms sont manquants.

In [145]:
dotation[dotation['nom'].isna()]

    id  nom     prenom  age  dotation
4    5  NaN     Benoît   58    759.34
16  17  NaN      Laure   80    291.83
27  28  NaN      Henri   29       NaN
32  33  NaN   Dorothée   18    754.86
38  39  NaN        NaN   80    516.92
39  40  NaN  Charlotte   69    363.57
44  45  NaN        NaN   57    878.12

In [134]:
dotation[dotation['nom'].isna() & dotation['prenom'].isna()]

    id  nom prenom  age  dotation
38  39  NaN    NaN   80       NaN
44  45  NaN    NaN   57       NaN

##### Supprimer ces lignes

In [146]:
dotation = dotation.dropna(subset=['nom', 'prenom'], how = 'all')
print(dotation)

    id         nom     prenom  age  dotation
0    1      Delmas     Gérard   60    133.71
1    2       Cohen   Lorraine   86    142.39
2    3     Raymond   Virginie   37    439.74
3    4      Pineau       Inès   40    203.31
4    5         NaN     Benoît   58    759.34
5    6     Bonneau       René   81       NaN
6    7    Delattre     Honoré   37    744.44
7    8     Rousset       Yves   26    594.21
8    9       Payet        NaN   53    780.01
9   10       Alves      Denis   36       NaN
10  11       Lecoq    Olivier   72       NaN
11  12      Perret        NaN   37       NaN
12  13      Joseph     Margot   41    271.19
13  14     Prévost        NaN   90    951.85
14  15    Ollivier      Lucas   40    943.49
15  16  Dos Santos  Henriette   43    865.86
16  17         NaN      Laure   80    291.83
17  18    Langlois  Charlotte   24    195.04
18  19     Legrand   Éléonore   37    910.99
19  20     Gautier   Caroline   69    386.50
20  21    Gosselin     Célina   20    359.77
21  22     Guillot    Édouard   53    762.99
22  23       Leleu   Victoire   63    748.23
23  24       Blanc       Léon   61       NaN
24  25     Laroche      Alain   52    909.46
25  26       Lopez    Charles   55    674.76
26  27         Gay        NaN   55    737.05
27  28         NaN      Henri   29       NaN
28  29      Cousin    Richard   61       NaN
29  30     Fischer       Nath   54    634.15
30  31        Huet   Théodore   58    184.65
31  32     Schmitt  Constance   72       NaN
32  33         NaN   Dorothée   18    754.86
33  34    Ferreira  Constance   86    869.77
34  35    Courtois    Susanne   27    375.44
35  36       Faure      Élise   54    455.34
36  37     Richard   Nathalie   79    921.29
37  38      Renaud       Alex   63    921.66
39  40         NaN  Charlotte   69    363.57
40  41       Neveu     Odette   64    863.20
41  42      Mendès     Jérôme   38    312.63
42  43       Guyot   Emmanuel   62    954.33
43  44     Blondel    Charles   40    850.63
45  46     Bernier        NaN   67    589.50
46  47    Thibault     Louise   71       NaN
47  48     Blondel      Roger   77    215.80
48  49        Lévy     Gérard   86    109.02
49  50    Langlois   Nathalie   41       NaN

In [147]:
#### reindexer tout en gardant l'ancien indexation
### dotation.reset_index(drop=False)
#### reindexer en supprimant lancien indexation
dotation= dotation.reset_index(drop=True)

##### Traitement des NAN

In [148]:
## remplacer les noms ou prenoms NAN par 'non_defini'
dotation['nom'] = dotation['nom'].fillna('non_defini')
dotation['prenom'] = dotation['prenom'].fillna('non_defini')
#print(dotation)

In [149]:
## remplacer les dotations nan par la moyenne des dotations disponibles
dotation['dotation'] = dotation['dotation'].fillna(dotation['dotation'].mean())
dotation['dotation'] = dotation['dotation'].round(2)
print(dotation)

    id         nom      prenom  age  dotation
0    1      Delmas      Gérard   60    133.71
1    2       Cohen    Lorraine   86    142.39
2    3     Raymond    Virginie   37    439.74
3    4      Pineau        Inès   40    203.31
4    5  non_defini      Benoît   58    759.34
5    6     Bonneau        René   81    583.74
6    7    Delattre      Honoré   37    744.44
7    8     Rousset        Yves   26    594.21
8    9       Payet  non_defini   53    780.01
9   10       Alves       Denis   36    583.74
10  11       Lecoq     Olivier   72    583.74
11  12      Perret  non_defini   37    583.74
12  13      Joseph      Margot   41    271.19
13  14     Prévost  non_defini   90    951.85
14  15    Ollivier       Lucas   40    943.49
15  16  Dos Santos   Henriette   43    865.86
16  17  non_defini       Laure   80    291.83
17  18    Langlois   Charlotte   24    195.04
18  19     Legrand    Éléonore   37    910.99
19  20     Gautier    Caroline   69    386.50
20  21    Gosselin      Célina   20    359.77
21  22     Guillot     Édouard   53    762.99
22  23       Leleu    Victoire   63    748.23
23  24       Blanc        Léon   61    583.74
24  25     Laroche       Alain   52    909.46
25  26       Lopez     Charles   55    674.76
26  27         Gay  non_defini   55    737.05
27  28  non_defini       Henri   29    583.74
28  29      Cousin     Richard   61    583.74
29  30     Fischer        Nath   54    634.15
30  31        Huet    Théodore   58    184.65
31  32     Schmitt   Constance   72    583.74
32  33  non_defini    Dorothée   18    754.86
33  34    Ferreira   Constance   86    869.77
34  35    Courtois     Susanne   27    375.44
35  36       Faure       Élise   54    455.34
36  37     Richard    Nathalie   79    921.29
37  38      Renaud        Alex   63    921.66
38  40  non_defini   Charlotte   69    363.57
39  41       Neveu      Odette   64    863.20
40  42      Mendès      Jérôme   38    312.63
41  43       Guyot    Emmanuel   62    954.33
42  44     Blondel     Charles   40    850.63
43  46     Bernier  non_defini   67    589.50
44  47    Thibault      Louise   71    583.74
45  48     Blondel       Roger   77    215.80
46  49        Lévy      Gérard   86    109.02
47  50    Langlois    Nathalie   41    583.74

##### Sauvegarde

In [152]:
dotation.to_csv('dotation_du_personnel_nettoyer_new.csv', index= False, sep=";")
print("sauvegarde effectué")

sauvegarde effectué